## Assignment on  Python pandas.
### Submitted by :Monika Dogra
### Batch : Mon-Fri (7 jan 2021)

In [1]:
# Write a Python program to create and display a one-
# dimensional array-like object containing an array of data using Pandas module.
 
import pandas as pd
lst = [10,20,30,40,50]
ser = pd.Series(lst)
print(ser)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [2]:
# Write a Python program to convert a Panda module Series to
# Python list and its type

lst_ser = list(ser)
print(lst_ser,type(lst_ser))

[10, 20, 30, 40, 50] <class 'list'>

In [3]:
# Write a Python program to add, subtract, multiple and divide
# two Pandas Series.

s1 = pd.Series( [10,20,30,40,50])
s2 = pd.Series([220,33,34,23,76])

print("Addition:\n",s1+s2)
print()
print("Subtraction:\n",s1-s2)
print()
print("Multiplication:\n",s1*s2)
print()
print("Division:\n",s1*s2)

Addition:
 0    230
1     53
2     64
3     63
4    126
dtype: int64

Subtraction:
 0   -210
1    -13
2     -4
3     17
4    -26
dtype: int64

Multiplication:
 0    2200
1     660
2    1020
3     920
4    3800
dtype: int64

Division:
 0    2200
1     660
2    1020
3     920
4    3800
dtype: int64

In [8]:
# Write a Python program to compare the elements of the two
# Pandas Series.



s1 = pd.Series( [10,20,30,40,50])
s2 = pd.Series([220,33,34,23,76])

print("Equal elements:")
print(s1==s2)
print()
print("Greater elements:")
print(s1>s2)
print()
print("Less than elements:")
print(s1<s2)

Equal elements:
0    False
1    False
2    False
3    False
4    False
dtype: bool

Greater elements:
0    False
1    False
2    False
3     True
4    False
dtype: bool

Less than elements:
0     True
1     True
2     True
3    False
4     True
dtype: bool

In [10]:
# Write a Python program to display the following data column
# wise.


dictonary = {"Col1":[10,24,34,56,75],
            "Col2":[34,54,23,56,72],
            "col3":[87,48,45,23,50]}
data = pd.DataFrame(dictonary)
data

   Col1  Col2  col3
0    10    34    87
1    24    54    48
2    34    23    45
3    56    56    23
4    75    72    50

In [12]:
# Write a Python program to create and display a Data Frame
# from a specified dictionary data which has the index labels.

dictonary = {"Col1":[10,24,34,56,75],
            "Col2":[34,54,23,56,72],
            "col3":[87,48,45,23,50]}
index = ['a','b','c','d','e']

data = pd.DataFrame(dictonary,index = index)
data

   Col1  Col2  col3
a    10    34    87
b    24    54    48
c    34    23    45
d    56    56    23
e    75    72    50

In [21]:
# Write a Python program to select the specified columns and
# rows from a given Data Frame.
data.iloc[[1,2,3],[1,2]]

   Col2  col3
b    54    48
c    23    45
d    56    23

In [24]:
data.loc[['a','c'],['Col1']]

   Col1
a    10
c    34

In [42]:
# Write a Python program to select the rows the score is between
# 15 and 20 (inclusive).

dic = {"Name":["Monika","Ritesh","Ashish","Suraj","Amit","Sunena"],
       "RollNo":[34,54,23,56,30,43],
       "Score":[10,17,19,23,34,21]}

df = pd.DataFrame(dic)
df[(df.Score >=15) & (df.Score <=20)]

     Name  RollNo  Score
1  Ritesh      54     17
2  Ashish      23     19

In [43]:
# Write a Python program to select the rows where number of
# attempts in the examination is less than 2 and score greater than
# 15.


dataframe = {"Name":["Monika","Ritesh","Ashish","Suraj","Amit","Sunena"],
           "Attempts":[3,1,2,1,1,3],
           "Score":[10,17,19,23,34,21]}


df = pd.DataFrame(dataframe)
df[(df.Attempts<2) & (df.Score>15)]

     Name  Attempts  Score
1  Ritesh         1     17
3   Suraj         1     23
4    Amit         1     34

In [60]:
# Write a Python program to append a new row 'k' to Data Frame
# with given values for each column. Now delete the new row and
# return the original data frame.

data = {'name': ['Somu', 'Kiku', 'Amol', 'Lini'],
    'physics': [68, 74, 77, 78],
    'chemistry': [84, 56, 73, 69],
    'algebra': [78, 88, 82, 87]}
index = ['a','d','f','m']

df = pd.DataFrame(data,index = index)
print("Before adding the new row:\n",df)

# adding 'k' row:
df.loc['k'] = ['Smriti', 26, 92, 97]
print()
print("After adding the new row:\n",df)
print()

# delete the row and back to original;
print("Delete the row:\n",df.drop('k',axis =0))

Before adding the new row:
    name  physics  chemistry  algebra
a  Somu       68         84       78
d  Kiku       74         56       88
f  Amol       77         73       82
m  Lini       78         69       87

After adding the new row:
      name  physics  chemistry  algebra
a    Somu       68         84       78
d    Kiku       74         56       88
f    Amol       77         73       82
m    Lini       78         69       87
k  Smriti       26         92       97

Delete the row:
    name  physics  chemistry  algebra
a  Somu       68         84       78
d  Kiku       74         56       88
f  Amol       77         73       82
m  Lini       78         69       87

In [70]:
# Write a Python program to sort the data frame first by 'name' in
# descending order, then by 'score' in ascending order.

dataframe = {"Name":["Monika","Ritesh","Ashish","Suraj","Amit","Sunena"],
           "Attempts":[3,1,2,1,1,3],
           "Score":[10,17,19,23,34,21]}

df =pd.DataFrame(dataframe)

#first by 'name' in descending order:
print(df.sort_values(by=['Name'], ascending=[False]))
print()

# then by 'score' in ascending order.:
print(df.sort_values(by=['Score'], ascending=[True]))

     Name  Attempts  Score
3   Suraj         1     23
5  Sunena         3     21
1  Ritesh         1     17
0  Monika         3     10
2  Ashish         2     19
4    Amit         1     34

     Name  Attempts  Score
0  Monika         3     10
1  Ritesh         1     17
2  Ashish         2     19
5  Sunena         3     21
3   Suraj         1     23
4    Amit         1     34

In [73]:
# Write a Python program to insert a new column in existing Data
# Frame.

dataframe = {"Name":["Monika","Ritesh","Ashish","Suraj","Amit","Sunena"],
           "Attempts":[3,1,2,1,1,3],
           "Score":[10,17,19,23,34,21]}

df = pd.DataFrame(dataframe)

# after adding new adding new column:
df["New_col"] = ["a","b","c","d","e","f"]
df

     Name  Attempts  Score New_col
0  Monika         3     10       a
1  Ritesh         1     17       b
2  Ashish         2     19       c
3   Suraj         1     23       d
4    Amit         1     34       e
5  Sunena         3     21       f

In [85]:
# Write a Python program to change the name 'James' to 'Suresh'
# in name column of the data frame.
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James',
    'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no',
    'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

data = pd.DataFrame(exam_data,index = labels)

print("Before the change:\n", data.head())

# after changing the name:
print()
data.loc['d','name'] = 'Suresh'
print("After the change:\n", data.head())

Before the change:
         name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no

After the change:
         name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d     Suresh    NaN         3      no
e      Emily    9.0         2      no